yulee1982/stm32f767_freertos_lwip/usb-framework/libusb_stm32/src/usbd_stm32f767_otgfs.c
/* This file is the part of the Lightweight USB device Stack for STM32 microcontrollers
 *
 * Copyright ©2016 Dmitry Filimonchuk <dmitrystu[at]gmail[dot]com>
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *   http://www.apache.org/licenses/LICENSE-2.0
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */
#include <stdio.h>
#include <stdint.h>
#include <stdbool.h>
#include "stm32_compat.h"
#include "usb.h"
#include "usb_dwc2_param.h"
//#include "dwc2_type.h"

#if defined(USBD_STM32F767FS)

#define MAX_EP          6
#define MAX_RX_PACKET   128  /*in 32-bit chunks; 128*4=512 byte */
#define MAX_CONTROL_EP  1
#define MAX_FIFO_SZ     320  /*in 32-bit chunks; 320*4=1280 byte = 1.25K byte */

#define RX_FIFO_SZ      ((5 * MAX_CONTROL_EP + 8) + ((MAX_RX_PACKET / 4) + 1) + (MAX_EP * 2) + 1)  //59

#define STATUS_VAL(x)   (USBD_HW_ADDRFST | (x))

#define USB_OTG_FS_GLOBAL ((USB_OTG_GlobalTypeDef *)(USB_OTG_FS_PERIPH_BASE + USB_OTG_GLOBAL_BASE))
#define USB_OTG_FS_DEVICE ((USB_OTG_DeviceTypeDef *)(USB_OTG_FS_PERIPH_BASE + USB_OTG_DEVICE_BASE))
#define USB_OTG_FS_PCGCCTL *((__IO uint32_t *)(USB_OTG_FS_PERIPH_BASE + USB_OTG_PCGCCTL_BASE))

#define IN_ENDPOINT(i)  ((USB_OTG_INEndpointTypeDef *)(USB_OTG_FS_PERIPH_BASE + USB_OTG_IN_ENDPOINT_BASE + ((i) * USB_OTG_EP_REG_SIZE)))
#define OUT_ENDPOINT(i)  ((USB_OTG_OUTEndpointTypeDef *)(USB_OTG_FS_PERIPH_BASE + USB_OTG_OUT_ENDPOINT_BASE + ((i) * USB_OTG_EP_REG_SIZE)))
#define EPFIFO(i)  *(__IO uint32_t *)(USB_OTG_FS_PERIPH_BASE + USB_OTG_FIFO_BASE + ((i) * USB_OTG_FIFO_SIZE))

#define CONFIG_CPU_CLOCK_HZ  (SystemCoreClock)


typedef union {
  uint32_t value;
  struct TU_ATTR_PACKED {
    uint32_t ep_ch_num     : 4; // 0..3 Endpoint/Channel Number
    uint32_t byte_count    :11; // 4..14 Byte Count
    uint32_t dpid          : 2; // 15..16 Data PID
    uint32_t packet_status : 4; // 17..20 Packet Status
    uint32_t frame_number  : 4; // 21..24 Frame Number
    uint32_t rsv25_31      : 7; // 25..31 Reserved
  };
} dwc2_grxstsp_t;

#ifndef CONFIG_USB_DWC2_CUSTOM_PARAM
const struct dwc2_user_params param_pa11_pa12 = {
  .phy_type = DWC2_PHY_TYPE_PARAM_FS,
  .device_dma_enable = false,
  .device_dma_desc_enable = false,
  .device_rx_fifo_size = (320 - 16 - 16 - 16 - 16 - 16 - 16),
  .device_tx_fifo_size = {
        [0] = 16, // 64 byte
        [1] = 16, // 64 byte
        [2] = 16, // 64 byte
        [3] = 16, // 64 byte
        [4] = 16,
        [5] = 16,
        [6] = 0,
        [7] = 0,
        [8] = 0,
        [9] = 0,
        [10] = 0,
        [11] = 0,
        [12] = 0,
        [13] = 0,
        [14] = 0,
        [15] = 0 },

  .device_gccfg = (1 << 16), // fs: USB_OTG_GCCFG_PWRDWN
  .host_gccfg = (1 << 16),   // fs: USB_OTG_GCCFG_PWRDWN

  .b_session_valid_override = true,
  .total_fifo_size = 320 // 1280 byte
};
/*
const struct dwc2_user_params param_pb14_pb15 = {
  .phy_type = DWC2_PHY_TYPE_PARAM_FS,
  .device_dma_enable = false,
  .device_dma_desc_enable = false,
  .device_rx_fifo_size = (1006 - 16 - 256 - 128 - 128 - 128 - 128),
  .device_tx_fifo_size = {
        [0] = 16,  // 64 byte
        [1] = 256, // 1024 byte
        [2] = 128, // 512 byte
        [3] = 128, // 512 byte
        [4] = 128, // 512 byte
        [5] = 128, // 512 byte
        [6] = 0,
        [7] = 0,
        [8] = 0,
        [9] = 0,
        [10] = 0,
        [11] = 0,
        [12] = 0,
        [13] = 0,
        [14] = 0,
        [15] = 0 },

  .host_dma_desc_enable = false,
  .host_rx_fifo_size = 622,
  .host_nperio_tx_fifo_size = 128, // 512 byte
  .host_perio_tx_fifo_size = 256,  // 1024 byte
  .device_gccfg = (1 << 16), // fs: USB_OTG_GCCFG_PWRDWN hs:0
  .host_gccfg = (1 << 16),   // fs: USB_OTG_GCCFG_PWRDWN hs:0
  .b_session_valid_override = true
};
*/
#endif // CONFIG_USB_DWC2_CUSTOM_PARAM


static void portinit(void)
{
  /**USBOTG GPIO Configuration
  PA9    ------> OTG_FS_VBUS ?
  PA10   ------> USB_ID      OTG_FS_ID
  PA11   ------> USB_DM D-   OTG_FS_DM
  PA12   ------> USB_DP D+   OTG_FS_DP
  PG6    ------> USB_PowerSwitchOn
  PG7    ------> USB_OverCurrent
  */
  //Enables the clock for GPIOA
  SET_BIT(RCC->AHB1ENR, RCC_AHB1ENR_GPIOAEN);
  SET_BIT(RCC->AHB1ENR, RCC_AHB1ENR_GPIOGEN);

  //Configures USB pins (in GPIOA) to work in alternate function mode.
  //Sets alternate function 10 for : PA11 (-) otg_fs_dm , and PA12 (+) otg_fs_dp.
  GPIOA->MODER &= ~((0x3 << 24) | (0x3 << 22));
  GPIOA->MODER |= ((0x2 << 24) | (0x2 << 22)); //复用功能模式
  GPIOA->AFR[1] &= 0xfff00fff;
  GPIOA->AFR[1] |= 0x000aa000;  //AFR12[3:0] = AFR11[3:0] = af10(0xa)
  GPIOA->OTYPER &= ~((0x1 << 12) | (0x1 << 11)); // 复位状态 推挽输出
  GPIOA->OSPEEDR |= ((0x3 << 24) | (0x3 << 22)); // IO速度 高速
  GPIOA->PUPDR &= ~((0x3 << 24) | (0x3 << 22)); // 无上下拉

  /* This for ID line debug  PA10 (id) otg_fs_id*/
  //GPIOA->AFR[1] &= 0xfffff0ff;
  //GPIOA->AFR[1] |= 0x00000a00;  //AFR10[3:0] = af10(0xa)
  //GPIOA->OTYPER |= (0x1 << 10); // 开漏输出类型
  //GPIOA->OSPEEDR |= (0x3 << 20); // IO速度 高速
  //GPIOA->PUPDR &= ~(0x3 << 20);
  //GPIOA->PUPDR |= ~(0x1 << 20); //上拉

  /* Configure Power Switch Vbus Pin  PA6 */
  GPIOA->MODER &= ~(0x3 << 12);
  GPIOA->MODER |= (0x1 << 12); //输出模式

  /* Configure PA7 */
  GPIOA->MODER &= ~(0x3 << 14); //输入模式

  /* Enable USB FS Clocks */
  RCC->AHB2ENR |= RCC_AHB2ENR_OTGFSEN;
  RCC->APB2ENR |= RCC_APB2ENR_SYSCFGEN;

  /* Set USBFS Interrupt to the lowest priority */
  /* Enable USBFS Interrupt */
  NVIC_SetPriority(OTG_FS_IRQn, 7);
  NVIC_EnableIRQ(OTG_FS_IRQn);

#if 0
  LL_GPIO_InitTypeDef GPIO_InitStruct = {0};

  /* Configure USB FS GPIOs */
  //Enables the clock for GPIOA GPIOG
  LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_GPIOA); //SET_BIT(RCC->AHB1ENR, RCC_AHB1ENR_GPIOAEN);
  LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_GPIOG);//SET_BIT(RCC->AHB1ENR, RCC_AHB1ENR_GPIOGEN);

  /* Configure DM DP Pins */
  GPIO_InitStruct.Pin = LL_GPIO_PIN_11|LL_GPIO_PIN_12;
  GPIO_InitStruct.Mode = LL_GPIO_MODE_ALTERNATE;  // 备用功能模式
  GPIO_InitStruct.OutputType = LL_GPIO_OUTPUT_PUSHPULL;    // 推挽输出模式
  GPIO_InitStruct.Speed = LL_GPIO_SPEED_FREQ_HIGH;
  GPIO_InitStruct.Pull = LL_GPIO_PULL_NO;    // 无上下拉
  GPIO_InitStruct.Alternate = GPIO_AF10_OTG_FS;
  LL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  /* This for ID line debug */
  GPIO_InitStruct.Pin = LL_GPIO_PIN_10;
  GPIO_InitStruct.Mode = LL_GPIO_MODE_ALTERNATE;  // 备用功能模式
  GPIO_InitStruct.OutputType = LL_GPIO_OUTPUT_OPENDRAIN;    // 开漏输出类型
  GPIO_InitStruct.Speed = LL_GPIO_SPEED_FREQ_HIGH;
  GPIO_InitStruct.Pull = LL_GPIO_PULL_UP;
  GPIO_InitStruct.Alternate = GPIO_AF10_OTG_FS;
  LL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  /* Configure Power Switch Vbus Pin */
  LL_GPIO_SetPinMode(GPIOG, LL_GPIO_PIN_6, LL_GPIO_MODE_OUTPUT); //无上下拉，推挽输出
  LL_GPIO_ResetOutputPin(GPIOG, LL_GPIO_PIN_6);

