yulee1982/stm32f767_freertos_lwip/usb-framework/libusb_stm32/src/usbd_stm32f767_otgfs.c
  LL_GPIO_SetPinMode(GPIOG, LL_GPIO_PIN_7, LL_GPIO_MODE_INPUT);
  LL_GPIO_SetPinPull(GPIOG, LL_GPIO_PIN_7, LL_GPIO_PULL_NO);

  /* Enable USB FS Clocks */
  //RCC->AHB2ENR |= RCC_AHB2ENR_OTGFSEN;
  //RCC->APB2ENR |= RCC_APB2ENR_SYSCFGEN;

  /* Set USBFS Interrupt to the lowest priority */
  /* Enable USBFS Interrupt */
  //NVIC_SetPriority(OTG_FS_IRQn, 3);
  //NVIC_EnableIRQ(OTG_FS_IRQn);

#endif
}


inline static uint8_t flush_rxfifo(void)
{
#if 0
  _BST(USB_OTG_FS_GLOBAL->GRSTCTL, USB_OTG_GRSTCTL_RXFFLSH);
  _WBC(USB_OTG_FS_GLOBAL->GRSTCTL, USB_OTG_GRSTCTL_RXFFLSH);
#else
  volatile uint32_t count = 0U;

  /* Wait for AHB master IDLE state. */
  do
  {
    if(++count > 200000U)
    {
      return -1;
    }
  }while((USB_OTG_FS_GLOBAL->GRSTCTL & USB_OTG_GRSTCTL_AHBIDL) == 0U);

  count = 0;
  USB_OTG_FS_GLOBAL->GRSTCTL = USB_OTG_GRSTCTL_RXFFLSH;

  do
  {
    if(++count > 200000U)
    {
      return -1;
    }
  }while((USB_OTG_FS_GLOBAL->GRSTCTL & USB_OTG_GRSTCTL_RXFFLSH) == USB_OTG_GRSTCTL_RXFFLSH);

  return 0;
#endif
}

inline static uint8_t flush_txfifo(uint8_t ep)
{
#if 0
  _BMD(USB_OTG_FS_GLOBAL->GRSTCTL, USB_OTG_GRSTCTL_TXFNUM, _VAL2FLD(USB_OTG_GRSTCTL_TXFNUM, ep) | USB_OTG_GRSTCTL_TXFFLSH);
  _WBC(USB_OTG_FS_GLOBAL->GRSTCTL, USB_OTG_GRSTCTL_TXFFLSH);
#else
  __IO uint32_t count = 0U;

  /* Wait for AHB master IDLE state. */
  do
  {
    if(count++ > 0xF000000)
    {
      return 1;
    }
  }while((USB_OTG_FS_GLOBAL->GRSTCTL & USB_OTG_GRSTCTL_AHBIDL) == 0U);

  /* Flush TX Fifo */
  count = 0U;
  //USB_OTG_FS_GLOBAL->GRSTCTL = (USB_OTG_GRSTCTL_TXFFLSH | (ep << 6)); //USB_OTG_GRSTCTL_TXFNUM_Pos
  _BMD(USB_OTG_FS_GLOBAL->GRSTCTL, USB_OTG_GRSTCTL_TXFNUM,
			 _VAL2FLD(USB_OTG_GRSTCTL_TXFNUM, ep) | USB_OTG_GRSTCTL_TXFFLSH);
  do
  {
    if (count++ > 0xF000000)
    {
      return 1;
    }
  } while((USB_OTG_FS_GLOBAL->GRSTCTL & USB_OTG_GRSTCTL_TXFFLSH) == USB_OTG_GRSTCTL_TXFFLSH);

  return 0;
#endif
}


static uint32_t getinfo(void) {
    if (!(RCC->AHB2ENR & RCC_AHB2ENR_OTGFSEN)) return STATUS_VAL(0);
    if (!(USB_OTG_FS_DEVICE->DCTL & USB_OTG_DCTL_SDIS)) return STATUS_VAL(USBD_HW_ENABLED | USBD_HW_SPEED_FS);
    return STATUS_VAL(USBD_HW_ENABLED);
}

static void ep_setstall(uint8_t ep, bool stall)
{
  if(ep & 0x80)
  {
    ep &= 0x7F;
    uint32_t _t = IN_ENDPOINT(ep)->DIEPCTL;

    if(_t & USB_OTG_DIEPCTL_USBAEP)
    {
      if(stall)
        _BST(_t, USB_OTG_DIEPCTL_STALL);
      else
        _BMD(_t, USB_OTG_DIEPCTL_STALL, USB_OTG_DIEPCTL_SD0PID_SEVNFRM | USB_OTG_DOEPCTL_SNAK);

      IN_ENDPOINT(ep)->DIEPCTL = _t;
    }
  }else{
    uint32_t _t = OUT_ENDPOINT(ep)->DOEPCTL;
    if(_t & USB_OTG_DOEPCTL_USBAEP)
    {
      if(stall)
        _BST(_t, USB_OTG_DOEPCTL_STALL);
      else
        _BMD(_t, USB_OTG_DOEPCTL_STALL, USB_OTG_DOEPCTL_SD0PID_SEVNFRM | USB_OTG_DOEPCTL_CNAK);

      OUT_ENDPOINT(ep)->DOEPCTL = _t;
    }
  }
}

static bool ep_isstalled(uint8_t ep)
{
  if(ep & 0x80)
  {
    ep &= 0x7F;
    return (IN_ENDPOINT(ep)->DIEPCTL & USB_OTG_DIEPCTL_STALL) ? true : false;
  }else{
    return (OUT_ENDPOINT(ep)->DOEPCTL & USB_OTG_DOEPCTL_STALL) ? true : false;
  }
}

static void dwc2_set_txfifo(uint8_t fifo, uint16_t size)
{
  uint8_t i;
  uint32_t tx_offset;

  /*  TXn min size = 16 words. (n  : Transmit FIFO index)
      When a TxFIFO is not used, the Configuration should be as follows:
          case 1 :  n > m    and Txn is not used    (n,m  : Transmit FIFO indexes)
         --> Txm can use the space allocated for Txn.
         case2  :  n < m    and Txn is not used    (n,m  : Transmit FIFO indexes)
         --> Txn should be configured with the minimum space of 16 words
      The FIFO is used optimally when used TxFIFOs are allocated in the top
         of the FIFO.Ex: use EP1 and EP2 as IN instead of EP1 and EP3 as IN ones.
      When DMA is used 3n * FIFO locations should be reserved for internal DMA registers */

  tx_offset = USB_OTG_FS_GLOBAL->GRXFSIZ;

  if(fifo == 0U)
  {
    USB_OTG_FS_GLOBAL->DIEPTXF0_HNPTXFSIZ = ((uint32_t)size << 16) | tx_offset;
  }else{
    tx_offset += (USB_OTG_FS_GLOBAL->DIEPTXF0_HNPTXFSIZ) >> 16;
    for(i = 0U; i < (fifo - 1U); i++)
    {
      tx_offset += (USB_OTG_FS_GLOBAL->DIEPTXF[i] >> 16);
    }

    /* Multiply Tx_Size by 2 to get higher performance */
    USB_OTG_FS_GLOBAL->DIEPTXF[fifo - 1U] = ((uint32_t)size << 16) | tx_offset;
  }

}
static void enable(bool enable)
{
  portinit();
  if(enable)
  {
    /* enabling USB_OTG in RCC */
    RCC->AHB2ENR |= RCC_AHB2ENR_OTGFSEN; //_BST(RCC->AHB2ENR, RCC_AHB2ENR_OTGFSEN);
    _WBS(USB_OTG_FS_GLOBAL->GRSTCTL, USB_OTG_GRSTCTL_AHBIDL); //while((OTG->GRSTCTL & USB_OTG_GRSTCTL_AHBIDL) == 0)

    /* configure OTG as device */
    USB_OTG_FS_GLOBAL->GUSBCFG = USB_OTG_GUSBCFG_FDMOD | USB_OTG_GUSBCFG_PHYSEL | _VAL2FLD(USB_OTG_GUSBCFG_TRDT, 0x06);

    /* configuring Vbus sense and powerup PHY */
    USB_OTG_FS_GLOBAL->GOTGCTL |= USB_OTG_GOTGCTL_BVALOEN | USB_OTG_GOTGCTL_BVALOVAL; //BVALID信号是AXI协议中用于指示写响应有效的信号
    USB_OTG_FS_GLOBAL->GCCFG = USB_OTG_GCCFG_PWRDWN; // USB_OTG_FS_GLOBAL->GCCFG = param_pa11_pa12.device_gccfg;

    /* Restart the Phy Clock */
    USB_OTG_FS_PCGCCTL = 0;

    /* soft disconnect device */
    USB_OTG_FS_DEVICE->DCTL |= USB_OTG_DCTL_SDIS; //_BST(OTGD->DCTL, USB_OTG_DCTL_SDIS);

    /* Setup USB FS speed and frame interval */
    _BMD(USB_OTG_FS_DEVICE->DCFG, USB_OTG_DCFG_PERSCHIVL | USB_OTG_DCFG_DSPD,
             _VAL2FLD(USB_OTG_DCFG_PERSCHIVL, 0) | _VAL2FLD(USB_OTG_DCFG_DSPD, 0x03));

    /* unmask EP interrupts */
    USB_OTG_FS_DEVICE->DIEPMSK = USB_OTG_DIEPMSK_XFRCM;

    /* unmask core interrupts */
    USB_OTG_FS_GLOBAL->GINTMSK = USB_OTG_GINTMSK_USBRST | USB_OTG_GINTMSK_ENUMDNEM |
#if !defined(USBD_SOF_DISABLED)
        USB_OTG_GINTMSK_SOFM |
#endif
		USB_OTG_GINTMSK_IEPINT | USB_OTG_GINTMSK_OEPINT |
        USB_OTG_GINTMSK_USBSUSPM | USB_OTG_GINTMSK_WUIM |
        USB_OTG_GINTMSK_RXFLVLM;

    /* clear pending interrupts */
    USB_OTG_FS_GLOBAL->GINTSTS = 0xFFFFFFFF;
    /* unmask global interrupt */
    USB_OTG_FS_GLOBAL->GAHBCFG = USB_OTG_GAHBCFG_GINT;

    /* setting max RX FIFO size */
    //USB_OTG_FS_GLOBAL->GRXFSIZ = RX_FIFO_SZ;
    USB_OTG_FS_GLOBAL->GRXFSIZ = param_pa11_pa12.device_rx_fifo_size;

    /* setting up EP0 TX FIFO SZ as 64 byte */
    USB_OTG_FS_GLOBAL->DIEPTXF0_HNPTXFSIZ = RX_FIFO_SZ | (0x10 << 16);
    for(uint8_t i = 0; i < MAX_EP; i++)
    {
      dwc2_set_txfifo(i, param_pa11_pa12.device_tx_fifo_size[i]);
    }

  }else{
    if(RCC->AHB2ENR & RCC_AHB2ENR_OTGFSEN)
    {
      _BST(RCC->AHB2RSTR, RCC_AHB2RSTR_OTGFSRST);
      _BCL(RCC->AHB2RSTR, RCC_AHB2RSTR_OTGFSRST);
      _BCL(RCC->AHB2ENR, RCC_AHB2ENR_OTGFSEN);
    }
  }
}

