yulee1982/stm32f767_freertos_lwip/usb-framework/libusb_stm32/src/usbd_stm32f767_otgfs.c
static uint8_t connect(bool connect)
{
  if(connect)
    _BCL(USB_OTG_FS_DEVICE->DCTL, USB_OTG_DCTL_SDIS);
  else
    _BST(USB_OTG_FS_DEVICE->DCTL, USB_OTG_DCTL_SDIS);

  return usbd_lane_unk;
}

static void setaddr(uint8_t addr)
{
  _BMD(USB_OTG_FS_DEVICE->DCFG, USB_OTG_DCFG_DAD, addr << 4);
}

/**\brief Helper. Set up TX fifo
 * \param ep endpoint index
 * \param epsize required max packet size in bytes
 * \return true if TX fifo is successfully set
 */
static bool set_tx_fifo(uint8_t ep, uint16_t epsize)
{
  uint32_t _fsa = USB_OTG_FS_GLOBAL->DIEPTXF0_HNPTXFSIZ;
  /* calculating initial TX FIFO address. next from EP0 TX fifo */
  _fsa = 0xFFFF & (_fsa + (_fsa >> 16));
  /* looking for next free TX fifo address */
  for(int i = 0; i < (MAX_EP - 1); i++)
  {
    uint32_t _t = USB_OTG_FS_GLOBAL->DIEPTXF[i];
    if((_t & 0xFFFF) < 0x200)
    {
      _t = 0xFFFF & (_t + (_t >> 16));
      if(_t > _fsa)
        _fsa = _t;
    }
  }
  /* calculating requited TX fifo size */
  /* getting in 32 bit terms */
  epsize = (epsize + 0x03) >> 2;
  /* it must be 16 32-bit words minimum */
  if(epsize < 0x10)
    epsize = 0x10;
  /* checking for the available fifo */
  if((_fsa + epsize) > MAX_FIFO_SZ)
    return false;
  /* programming fifo register */
  _fsa |= (epsize << 16);
  USB_OTG_FS_GLOBAL->DIEPTXF[ep - 1] = _fsa;
  return true;
}

static bool ep_config(uint8_t ep, uint8_t eptype, uint16_t epsize)
{
  if(ep == 0)
  {
    /* configureing control endpoint EP0 */
    uint32_t mpsize;
    if(epsize <= 0x08){
      epsize = 0x08;
      mpsize = 0x03;
    }
    else if(epsize <= 0x10){
      epsize = 0x10;
      mpsize = 0x02;
    }
    else if(epsize <= 0x20){
      epsize = 0x20;
      mpsize = 0x01;
    }else{
      epsize = 0x40;
      mpsize = 0x00;
    }
    /* EP0 TX FIFO size is setted on init level */
    /* enabling RX and TX interrupts from EP0 */
    USB_OTG_FS_DEVICE->DAINTMSK |= 0x00010001;
    /* setting up EP0 TX and RX registers */
    /*EPIN(ep)->DIEPTSIZ  = epsize;*/
    IN_ENDPOINT(ep)->DIEPCTL = mpsize | USB_OTG_DIEPCTL_SNAK;
    /* 1 setup packet, 1 packets total */
    OUT_ENDPOINT(ep)->DOEPTSIZ = epsize | (1 << 29) | (1 << 19);
    OUT_ENDPOINT(ep)->DOEPCTL = mpsize | USB_OTG_DOEPCTL_EPENA | USB_OTG_DOEPCTL_CNAK;
    //OUT_ENDPOINT(ep)->DOEPCTL = mpsize | USB_OTG_DOEPCTL_EPENA | USB_OTG_DOEPCTL_SNAK;
    return true;
  }
  if(ep & 0x80)
  {
    ep &= 0x7F;
    /* configuring TX endpoint */
    /* setting up TX fifo and size register */
    if((eptype == USB_EPTYPE_ISOCHRONUS) || (eptype == (USB_EPTYPE_BULK | USB_EPTYPE_DBLBUF)))
    {
      if(!set_tx_fifo(ep, epsize << 1))
        return false;
    }else{
      if(!set_tx_fifo(ep, epsize))
    	return false;
    }
    /* enabling EP TX interrupt */
    USB_OTG_FS_DEVICE->DAINTMSK |= (0x0001UL << ep);
    /* setting up TX control register*/
    switch(eptype)
    {
      case USB_EPTYPE_ISOCHRONUS:
        IN_ENDPOINT(ep)->DIEPCTL = USB_OTG_DIEPCTL_EPENA | USB_OTG_DIEPCTL_CNAK |
                                   (0x01 << 18) | USB_OTG_DIEPCTL_USBAEP |
                                   USB_OTG_DIEPCTL_SD0PID_SEVNFRM |
                                   (ep << 22) | epsize;
        break;
      case USB_EPTYPE_BULK:
      case USB_EPTYPE_BULK | USB_EPTYPE_DBLBUF:
        IN_ENDPOINT(ep)->DIEPCTL = USB_OTG_DIEPCTL_SNAK | USB_OTG_DIEPCTL_USBAEP |
                                   (0x02 << 18) | USB_OTG_DIEPCTL_SD0PID_SEVNFRM |
                                   (ep << 22) | epsize;
        break;

      default:
        IN_ENDPOINT(ep)->DIEPCTL = USB_OTG_DIEPCTL_SNAK | USB_OTG_DIEPCTL_USBAEP |
                                   (0x03 << 18) | USB_OTG_DIEPCTL_SD0PID_SEVNFRM |
                                   (ep << 22) | epsize;
        break;
    }
  }else{
    /* configuring RX endpoint */
    /* setting up RX control register */
    switch(eptype)
    {
      case USB_EPTYPE_ISOCHRONUS:
        OUT_ENDPOINT(ep)->DOEPCTL = USB_OTG_DOEPCTL_SD0PID_SEVNFRM | USB_OTG_DOEPCTL_CNAK |
                                    USB_OTG_DOEPCTL_EPENA | USB_OTG_DOEPCTL_USBAEP |
                                    (0x01 << 18) | epsize;
        break;
      case USB_EPTYPE_BULK | USB_EPTYPE_DBLBUF:
      case USB_EPTYPE_BULK:
        OUT_ENDPOINT(ep)->DOEPCTL = USB_OTG_DOEPCTL_SD0PID_SEVNFRM | USB_OTG_DOEPCTL_CNAK |
                                    USB_OTG_DOEPCTL_EPENA | USB_OTG_DOEPCTL_USBAEP |
                                    (0x02 << 18) | epsize;
        break;
      default:
        OUT_ENDPOINT(ep)->DOEPCTL = USB_OTG_DOEPCTL_SD0PID_SEVNFRM | USB_OTG_DOEPCTL_CNAK |
                                    USB_OTG_DOEPCTL_EPENA | USB_OTG_DOEPCTL_USBAEP |
                                    (0x03 << 18) | epsize;
        break;
    }
  }
  return true;
}

static void ep_deconfig(uint8_t ep)
{
  ep &= 0x7F;

  /* deconfiguring TX part */
  /* disable interrupt, Masks all interrupts of the targeted IN and OUT endpoints */
  //USB_OTG_FS_DEVICE->DAINTMSK &= ~((1 << ep) | (1 << 16 << ep));
  USB_OTG_FS_DEVICE->DAINTMSK &= ~(0x10001 << ep);

  /* decativating endpoint */
  IN_ENDPOINT(ep)->DIEPCTL &= ~(USB_OTG_DIEPCTL_USBAEP); //_BCL(in_endpoint->DIEPCTL, USB_OTG_DIEPCTL_USBAEP);

  /* flushing FIFO */
  flush_txfifo(ep);

  /* disabling endpoint */
  if((IN_ENDPOINT(ep)->DIEPCTL & USB_OTG_DIEPCTL_EPENA) && (ep != 0))
  {
    IN_ENDPOINT(ep)->DIEPCTL = USB_OTG_DIEPCTL_EPDIS; //Disables endpoint transmission
  }
  /* clean EP interrupts */
  IN_ENDPOINT(ep)->DIEPINT = 0xFF;
  /* deconfiguring TX FIFO */
  if(ep > 0)
    USB_OTG_FS_GLOBAL->DIEPTXF[ep-1] = 0x02000200 + 0x200 * ep;

  /* deconfigureing RX part */
    OUT_ENDPOINT(ep)->DOEPCTL &= ~USB_OTG_DOEPCTL_USBAEP;
  if((OUT_ENDPOINT(ep)->DOEPCTL & USB_OTG_DOEPCTL_EPENA) && (ep != 0))
    OUT_ENDPOINT(ep)->DOEPCTL = USB_OTG_DOEPCTL_EPDIS;
  OUT_ENDPOINT(ep)->DOEPINT = 0xFF;
}

static int32_t ep_read(uint8_t ep, void* buf, uint16_t blen)
{
  uint32_t len, tmp = 0;

  ep &= 0x7F;
  //volatile uint32_t *fifo = EPFIFO(0);

  /* no data in RX FIFO */
  if(!(USB_OTG_FS_GLOBAL->GINTSTS & USB_OTG_GINTSTS_RXFLVL))
    return -1;
  if((USB_OTG_FS_GLOBAL->GRXSTSR & USB_OTG_GRXSTSP_EPNUM) != ep)
    return -1;
  /* pop data from fifo */
  //len = _FLD2VAL(USB_OTG_GRXSTSP_BCNT, USB_OTG_FS_GLOBAL->GRXSTSP);
  len = ((USB_OTG_FS_GLOBAL->GRXSTSP & USB_OTG_GRXSTSP_BCNT) >> USB_OTG_GRXSTSP_BCNT_Pos);

  for(int idx = 0; idx < len; idx++)
  {
    if((idx & 0x03) == 0x00)
    {
      tmp = EPFIFO(0); //*fifo
    }
    if(idx < blen)
    {
      ((uint8_t*)buf)[idx] = tmp & 0xFF;
      tmp >>= 8;
    }
  }

  _BST(OUT_ENDPOINT(ep)->DOEPCTL, USB_OTG_DOEPCTL_CNAK | USB_OTG_DOEPCTL_EPENA);

