yulee1982/stm32f767_freertos_lwip/usb-framework/libusb_stm32/src/usbd_stm32f767_otgfs.c
  return (len < blen) ? len : blen;
}

static int32_t ep_write(uint8_t ep, const void *buf, uint16_t blen)
{
  uint32_t len, tmp;
  ep &= 0x7F;

  /* transfer data size in 32-bit words */
  len = (blen + 3) >> 2;
  /* no enough space in TX fifo */
  if(len > IN_ENDPOINT(ep)->DTXFSTS)
    return -1;
  if(ep != 0 && IN_ENDPOINT(ep)->DIEPCTL & USB_OTG_DIEPCTL_EPENA)
    return -1;

  IN_ENDPOINT(ep)->DIEPTSIZ = 0;
  IN_ENDPOINT(ep)->DIEPTSIZ = (1 << 19) + blen;
  _BMD(IN_ENDPOINT(ep)->DIEPCTL, USB_OTG_DIEPCTL_STALL, USB_OTG_DIEPCTL_EPENA | USB_OTG_DIEPCTL_CNAK);
  /* push data to FIFO */
  tmp = 0;
  for(int idx = 0; idx < blen; idx++)
  {
    tmp |= (uint32_t)((const uint8_t*)buf)[idx] << ((idx & 0x03) << 3);
    if((idx & 0x03) == 0x03 || (idx + 1) == blen)
    {
      EPFIFO(ep) = tmp;
      tmp = 0;
    }
  }
  return blen;
}

static uint16_t get_frame (void)
{
  return _FLD2VAL(USB_OTG_DSTS_FNSOF, USB_OTG_FS_DEVICE->DSTS);
}

void ep0_outstart_read_setup(void)
{
  OUT_ENDPOINT(0U)->DOEPTSIZ = 0U;
  OUT_ENDPOINT(0U)->DOEPTSIZ |= (USB_OTG_DOEPTSIZ_PKTCNT & (1U << 19));
  OUT_ENDPOINT(0U)->DOEPTSIZ |= (3U * 8U);
  OUT_ENDPOINT(0U)->DOEPTSIZ |=  USB_OTG_DOEPTSIZ_STUPCNT;
}

void set_turnaroundTime(uint32_t speed)
{
  uint32_t UsbTrd;

  UNUSED(speed);
  /* The USBTRD is configured according to the tables below, depending on AHB frequency
  used by application. In the low AHB frequency range it is used to stretch enough the USB response
  time to IN tokens, the USB turnaround time, so to compensate for the longer AHB read access
  latency to the Data FIFO */
  //if(speed == USBD_FS_SPEED)
  {
    if((CONFIG_CPU_CLOCK_HZ >= 14200000U) && (CONFIG_CPU_CLOCK_HZ < 15000000U))
    {
      /* hclk Clock Range between 14.2-15 MHz */
      UsbTrd = 0xFU;
    }
    else if((CONFIG_CPU_CLOCK_HZ >= 15000000U) && (CONFIG_CPU_CLOCK_HZ < 16000000U))
    {
      /* hclk Clock Range between 15-16 MHz */
      UsbTrd = 0xEU;
    }
    else if((CONFIG_CPU_CLOCK_HZ >= 16000000U) && (CONFIG_CPU_CLOCK_HZ < 17200000U))
    {
      /* hclk Clock Range between 16-17.2 MHz */
      UsbTrd = 0xDU;
    }
    else if((CONFIG_CPU_CLOCK_HZ >= 17200000U) && (CONFIG_CPU_CLOCK_HZ < 18500000U))
    {
      /* hclk Clock Range between 17.2-18.5 MHz */
      UsbTrd = 0xCU;
    }
    else if((CONFIG_CPU_CLOCK_HZ >= 18500000U) && (CONFIG_CPU_CLOCK_HZ < 20000000U))
    {
      /* hclk Clock Range between 18.5-20 MHz */
      UsbTrd = 0xBU;
    }
    else if((CONFIG_CPU_CLOCK_HZ >= 20000000U) && (CONFIG_CPU_CLOCK_HZ < 21800000U))
    {
      /* hclk Clock Range between 20-21.8 MHz */
      UsbTrd = 0xAU;
    }
    else if((CONFIG_CPU_CLOCK_HZ >= 21800000U) && (CONFIG_CPU_CLOCK_HZ < 24000000U))
    {
      /* hclk Clock Range between 21.8-24 MHz */
      UsbTrd = 0x9U;
    }
    else if((CONFIG_CPU_CLOCK_HZ >= 24000000U) && (CONFIG_CPU_CLOCK_HZ < 27700000U))
    {
      /* hclk Clock Range between 24-27.7 MHz */
      UsbTrd = 0x8U;
    }
    else if((CONFIG_CPU_CLOCK_HZ >= 27700000U) && (CONFIG_CPU_CLOCK_HZ < 32000000U))
    {
      /* hclk Clock Range between 27.7-32 MHz */
      UsbTrd = 0x7U;
    }
    else /* if(hclk >= 32000000) */
    {
      /* hclk Clock Range between 32-200 MHz */
      UsbTrd = 0x6U;
    }
  }
  /*
  else if(speed == USBD_HS_SPEED) //USBD_HS_SPEED
  {
    UsbTrd = 0x9U; //USBD_HS_TRDT_VALUE
  }
  else
  {
    UsbTrd = 0x9U; //USBD_DEFAULT_TRDT_VALUE
  }
  */

  USB_OTG_FS_GLOBAL->GUSBCFG &= ~USB_OTG_GUSBCFG_TRDT;
  USB_OTG_FS_GLOBAL->GUSBCFG |= (uint32_t)((UsbTrd << 10) & USB_OTG_GUSBCFG_TRDT);
}

static uint32_t get_outep_interrupt(uint32_t epnum)
{
  uint32_t tmpreg;

  tmpreg = OUT_ENDPOINT((uint32_t)epnum)->DOEPINT;
  OUT_ENDPOINT((uint32_t)epnum)->DOEPINT = tmpreg;
  tmpreg = tmpreg & USB_OTG_FS_DEVICE->DOEPMSK;

  return tmpreg;
}
static uint32_t get_inep_interrupt(uint32_t epnum)
{
  uint32_t tmpreg, msk, emp;

  msk = USB_OTG_FS_DEVICE->DIEPMSK;
  emp = USB_OTG_FS_DEVICE->DIEPEMPMSK;
  msk |= ((emp >> (epnum & 0x0F)) & 0x1U) << 7;

  tmpreg = IN_ENDPOINT((uint32_t)epnum)->DIEPINT;
  IN_ENDPOINT((uint32_t)epnum)->DIEPINT = tmpreg;
  tmpreg = tmpreg & msk;

  return tmpreg;
}

static void dwc2_ep0_start_read_setup(void)
{
  OUT_ENDPOINT(0U)->DOEPTSIZ = 0U;
  OUT_ENDPOINT(0U)->DOEPTSIZ |= (USB_OTG_DOEPTSIZ_PKTCNT & (1U << 19));
  OUT_ENDPOINT(0U)->DOEPTSIZ |= (3U * 8U);
  OUT_ENDPOINT(0U)->DOEPTSIZ |= USB_OTG_DOEPTSIZ_STUPCNT;
}
//--------------------------------------------------------------------
// Interrupt Handler
//--------------------------------------------------------------------

void handle_bus_reset(usbd_device *dev)
{
  uint32_t i;

  // 1. NAK for all OUT endpoints
  for(i = 0; i < MAX_EP; i++)
  {
    OUT_ENDPOINT(i)->DOEPCTL |= USB_OTG_DOEPCTL_SNAK;
    if(IN_ENDPOINT(i)->DIEPCTL & USB_OTG_DIEPCTL_EPENA)
      IN_ENDPOINT(i)->DIEPCTL |= (USB_OTG_DIEPCTL_EPDIS | USB_OTG_DIEPCTL_SNAK);
  }
  // Disable all IN endpoints
  for(i = 0; i < MAX_EP; i++)
  {
    if(IN_ENDPOINT(i)->DIEPCTL & USB_OTG_DIEPCTL_EPENA)
      IN_ENDPOINT(i)->DIEPCTL |= (USB_OTG_DIEPCTL_EPDIS | USB_OTG_DIEPCTL_SNAK);
  }

  // 2. Set up interrupt mask for EP0
  USB_OTG_FS_DEVICE->DAINTMSK = 0x10001U;
  USB_OTG_FS_DEVICE->DOEPMSK = USB_OTG_DOEPMSK_STUPM | USB_OTG_DOEPMSK_XFRCM;
  USB_OTG_FS_DEVICE->DIEPMSK = USB_OTG_DIEPMSK_TOM | USB_OTG_DIEPMSK_XFRCM;

  // 4. Set up DFIFO
  flush_txfifo(0x10);  // 10000:在设备模式或主机模式下刷新所有的发送 FIFO。
  flush_rxfifo();
  dfifo_device_init();

  //evt = usbd_evt_reset;
  //callback(dev, evt, 0);

  // 5. Reset device address
  //setaddr(0);

  // Start reading setup
  // Fixed both control EP0 size to 64 bytes
  dwc2_ep0_start_read_setup();

}

static void dcd_int_handler(usbd_device *dev, usbd_evt_callback callback)
{
#if 0
  uint32_t i;
  uint32_t ep_intr;
  uint32_t epint;
  uint32_t epnum;
  uint32_t RegVal;
  uint32_t evt;
  volatile uint32_t gintsts = USB_OTG_FS_GLOBAL->GINTSTS;

  /* ensure that we are in device mode */
  if((gintsts & 0x1U) == 0) //USB_OTG_MODE_DEVICE
  {
    gintsts &= USB_OTG_FS_GLOBAL->GINTMSK;
	if(gintsts == 0 )
      return;

    /* Handle Reset Interrupt */
	if(gintsts & USB_OTG_GINTSTS_USBRST)
	{
      USB_OTG_FS_GLOBAL->GINTSTS = USB_OTG_GINTSTS_USBRST;
      USB_OTG_FS_DEVICE->DCTL &= ~USB_OTG_DCTL_RWUSIG;

      flush_txfifo(0x10);  // 10000:在设备模式或主机模式下刷新所有的发送 FIFO。
      flush_rxfifo();
      for(i = 0U; i < MAX_EP; i++)
      {
        if(i == 0U)
        {
          IN_ENDPOINT(i)->DIEPCTL = USB_OTG_DIEPCTL_SNAK;
          OUT_ENDPOINT(i)->DOEPCTL = USB_OTG_DOEPCTL_SNAK;
        }else{
          if(IN_ENDPOINT(i)->DIEPCTL & USB_OTG_DIEPCTL_EPENA)
            IN_ENDPOINT(i)->DIEPCTL = (USB_OTG_DIEPCTL_EPDIS | USB_OTG_DIEPCTL_SNAK);
          else
            IN_ENDPOINT(i)->DIEPCTL = 0;

          if(OUT_ENDPOINT(i)->DOEPCTL & USB_OTG_DOEPCTL_EPENA)
            OUT_ENDPOINT(i)->DOEPCTL = (USB_OTG_DOEPCTL_EPDIS | USB_OTG_DOEPCTL_SNAK);
          else
            OUT_ENDPOINT(i)->DOEPCTL = 0;
        }
        IN_ENDPOINT(i)->DIEPTSIZ = 0U;
        IN_ENDPOINT(i)->DIEPINT = 0xFBFFU;
        OUT_ENDPOINT(i)->DOEPTSIZ = 0U;
        OUT_ENDPOINT(i)->DOEPINT = 0xFBFFU;
      }
      USB_OTG_FS_DEVICE->DAINTMSK |= 0x10001U;
      USB_OTG_FS_DEVICE->DOEPMSK = USB_OTG_DOEPMSK_STUPM | USB_OTG_DOEPMSK_XFRCM;
      USB_OTG_FS_DEVICE->DIEPMSK = USB_OTG_DIEPMSK_XFRCM;

      //setaddr(0);
      evt = usbd_evt_reset;
      callback(dev, evt, 0);
	}
    /* Handle Enumeration done Interrupt */
    if(gintsts & USB_OTG_GINTSTS_ENUMDNE)
    {
      //USB_OTG_FS_DEVICE->DCTL |= USB_OTG_DCTL_CGINAK;//(void)USB_ActivateSetup(hpcd->Instance);

