yulee1982/stm32f767_freertos_lwip/usb-framework/libusb_stm32/src/usbd_stm32f767_otgfs.c
      /* Set USB Turnaround time */
      //set_turnaroundTime(3); // speed = (USB_OTG_FS_DEVICE->DSTS & USB_OTG_DSTS_ENUMSPD) >> 1;
      //evt = usbd_evt_reset;
      //callback(dev, evt, 0);
      USB_OTG_FS_GLOBAL->GINTSTS = USB_OTG_GINTSTS_ENUMDNE;
    }
    /* Handle RxQLevel Interrupt */
    if(gintsts & USB_OTG_GINTSTS_RXFLVL)
    {
      // RXFLVL bit is read-only
      USB_OTG_FS_GLOBAL->GINTMSK &= ~USB_OTG_GINTMSK_RXFLVLM; // disable RXFLVL interrupt while reading

      do{
      RegVal = USB_OTG_FS_GLOBAL->GRXSTSP;
      epnum = RegVal & USB_OTG_GRXSTSP_EPNUM;
      //const dwc2_grxstsp_t grxstsp = {.value = USB_OTG_FS_GLOBAL->GRXSTSP};

      switch((RegVal & USB_OTG_GRXSTSP_PKTSTS) >> 17)
      {
        case 0x02:  //STS_DATA_UPDT
          evt = usbd_evt_eprx;
          break;
        case 0x06:  //STS_SETUP_UPDT
          evt = usbd_evt_epsetup;
          break;
        default:
          //USB_OTG_FS_GLOBAL->GRXSTSP;
          break;
      }
      callback(dev, evt, epnum);
      }while(USB_OTG_FS_GLOBAL->GINTSTS & USB_OTG_GINTSTS_RXFLVL);

      USB_OTG_FS_GLOBAL->GINTMSK |= USB_OTG_GINTMSK_RXFLVLM;
    }
    //OUT endpoint interrupt
    if(gintsts & USB_OTG_GINTSTS_OEPINT)
    {
      epnum = 0U;
      /* Read in the device interrupt bits */
      ep_intr = USB_OTG_FS_DEVICE->DAINT;
      ep_intr &= USB_OTG_FS_DEVICE->DAINTMSK;
      ep_intr = ((ep_intr & 0xffff0000U) >> 16);
      while(ep_intr != 0U)
      {
        if((ep_intr & 0x1U) != 0U)
        {
          epint = get_outep_interrupt(epnum);
          if((epint & USB_OTG_DOEPINT_XFRC) == USB_OTG_DOEPINT_XFRC)
          {
            if((epnum == 0U) && (dev->status.data_count == 0U)) /* this is ZLP, so prepare EP0 for next setup */
              ep_config(0, USB_EPTYPE_CONTROL, dev->status.ep0size);
            evt = usbd_evt_eprx;
            callback(dev, evt, epnum);
          }
        }
        epnum++;
        ep_intr >>= 1U;
      }
    }

    if(gintsts & USB_OTG_GINTSTS_IEPINT)
    {
      /* Read in the device interrupt bits */
      ep_intr = USB_OTG_FS_DEVICE->DAINT;
      ep_intr &= USB_OTG_FS_DEVICE->DAINTMSK;
      ep_intr &= 0xffff;

      epnum = 0U;
      while(ep_intr != 0U)
      {
        if((ep_intr & 0x1U) != 0U) /* In ITR */
        {
          epint = get_inep_interrupt(epnum); //epint = IN_ENDPOINT(epnum)->DIEPINT;
          if((epint & USB_OTG_DIEPINT_XFRC) == USB_OTG_DIEPINT_XFRC)
          {
            //fifoemptymsk = (uint32_t)(0x1UL << (epnum & 0xFU));
            //USB_OTG_FS_DEVICE->DIEPEMPMSK &= ~fifoemptymsk;
            evt = usbd_evt_eptx;
            callback(dev, evt, (epnum|0x80));
          }
        }
        epnum++;
        ep_intr >>= 1U;
      }
    }

    /* Handle Incomplete ISO OUT Interrupt */
    if(gintsts & USB_OTG_GINTSTS_PXFR_INCOMPISOOUT)
    {
      USB_OTG_FS_GLOBAL->GINTSTS = USB_OTG_GINTSTS_PXFR_INCOMPISOOUT;
    }
    /* Handle Incomplete ISO IN Interrupt */
    if(gintsts & USB_OTG_GINTSTS_IISOIXFR)
    {
      USB_OTG_FS_GLOBAL->GINTSTS = USB_OTG_GINTSTS_IISOIXFR;
    }
    /* Handle SOF Interrupt */
#if !defined(USBD_SOF_DISABLED)
    if(gintsts & USB_OTG_GINTSTS_SOF)
    {
      USB_OTG_FS_GLOBAL->GINTSTS = USB_OTG_GINTSTS_SOF;
      RegVal = USB_OTG_FS_GLOBAL->GRXSTSP;
      epnum = RegVal & USB_OTG_GRXSTSP_EPNUM;
      evt = usbd_evt_sof;
      callback(dev, evt, epnum);
    }
#endif
    /* Handle Suspend Interrupt */
    if(gintsts & USB_OTG_GINTSTS_USBSUSP)
    {
      if((USB_OTG_FS_DEVICE->DSTS & USB_OTG_DSTS_SUSPSTS) == USB_OTG_DSTS_SUSPSTS)
      {
        //HAL_PCD_SuspendCallback(hpcd);
      }
      USB_OTG_FS_GLOBAL->GINTSTS = USB_OTG_GINTSTS_USBSUSP;
    }
    /* Handle Resume Interrupt */
    if(gintsts & USB_OTG_GINTSTS_WKUINT)
    {
      /* Clear the Remote Wake-up Signaling */
      USB_OTG_FS_DEVICE->DCTL &= ~USB_OTG_DCTL_RWUSIG;
      USB_OTG_FS_GLOBAL->GINTSTS = USB_OTG_GINTSTS_WKUINT;
      RegVal = USB_OTG_FS_GLOBAL->GRXSTSP;
      epnum = RegVal & USB_OTG_GRXSTSP_EPNUM;
      evt = usbd_evt_wkup;
      callback(dev, evt, epnum);
    }
    /* Handle Disconnection event Interrupt */
    if(gintsts & USB_OTG_GINTSTS_OTGINT)
    {
      RegVal = USB_OTG_FS_GLOBAL->GOTGINT;

      if((RegVal & USB_OTG_GOTGINT_SEDET) == USB_OTG_GOTGINT_SEDET)
      {

      }else{

      }
      USB_OTG_FS_GLOBAL->GOTGINT |= RegVal;
    }
    if(gintsts & USB_OTG_GINTSTS_MMIS) //mode mismatch, device mode rw host reg or host mode rw device reg
    {
      USB_OTG_FS_GLOBAL->GINTSTS |= USB_OTG_GINTSTS_MMIS; /* incorrect mode, acknowledge the interrupt */
    }
    /* Handle LPM Interrupt, LinkPowerMangement */
    if(gintsts & USB_OTG_GINTSTS_LPMINT)
    {
      USB_OTG_FS_GLOBAL->GINTSTS = USB_OTG_GINTSTS_LPMINT;
    }
    /* Handle Connection event Interrupt */
    if(gintsts & USB_OTG_GINTSTS_SRQINT)
    {
      USB_OTG_FS_GLOBAL->GINTSTS =  USB_OTG_GINTSTS_SRQINT;
    }

  }
#else
  uint32_t evt;
  uint32_t ep = 0;
  while(1)
  {
    uint32_t _t = USB_OTG_FS_GLOBAL->GINTSTS;

    _t &= USB_OTG_FS_GLOBAL->GINTMSK;
	if(_t == 0 )
      return;

    if(_t & USB_OTG_GINTSTS_USBRST)/* bus RESET event */
    {
      USB_OTG_FS_GLOBAL->GINTSTS = USB_OTG_GINTSTS_USBRST;

      for(uint8_t i = 0; i < MAX_EP; i++ )
      {
        ep_deconfig(i);
      }
      flush_rxfifo();

      evt = usbd_evt_reset;

      //usbd_spin_lock(true);
      //handle_bus_reset();
      //usbd_spin_unlock(true);
    }
    else if(_t & USB_OTG_GINTSTS_ENUMDNE)/* 枚举完成 */
    {
      USB_OTG_FS_GLOBAL->GINTSTS = USB_OTG_GINTSTS_ENUMDNE;
      callback(dev, evt, ep);
    }
    else if(_t & USB_OTG_GINTSTS_IEPINT)
    {
      /**
       *  设备模式下IN端点挂起中断，必须读 OTG_DAINT 确定以确定发生中断的 IN 端点的准确编号
       *  然后读取相应的 OTG_DIEPINTx 寄存器,以确定引发中断的确切原因
       *  应用程序必须先将相应 OTG_DIEPINTx 寄存器的相应状态位清零,之后才能将该位清零
       */
      for(;; ep++)
      {
        if(ep >= MAX_EP)
          return;
        if(IN_ENDPOINT(ep)->DIEPINT & USB_OTG_DIEPINT_XFRC)
        {
          IN_ENDPOINT(ep)->DIEPINT = USB_OTG_DIEPINT_XFRC;
          evt = usbd_evt_eptx;
          ep |= 0x80;
          break;
        }
      }
    }
    else if(_t & USB_OTG_GINTSTS_RXFLVL) /* Rx FIFO 非空 */
    {
      _t = USB_OTG_FS_GLOBAL->GRXSTSR;
      ep = _t & USB_OTG_GRXSTSP_EPNUM;
      switch(_FLD2VAL(USB_OTG_GRXSTSP_PKTSTS, _t))
      //_t = ((_t & USB_OTG_GRXSTSP_PKTSTS_Msk) >> USB_OTG_GRXSTSP_PKTSTS);
      //switch(_t)
      {
        case 0x02:  // 接收到 OUT 数据包
          evt = usbd_evt_eprx;
          break;
        case 0x06:  // 接收到 SETUP 数据包
          evt = usbd_evt_epsetup;
          break;

        default:
          USB_OTG_FS_GLOBAL->GRXSTSP;
          continue;
      }
#if !defined(USBD_SOF_DISABLED)
    }
    else if(_t & USB_OTG_GINTSTS_SOF)  /* 帧起始 (Start of frame) SOF令牌，只有USB建立连接后有效 */
    {
      USB_OTG_FS_GLOBAL->GINTSTS = USB_OTG_GINTSTS_SOF;
      evt = usbd_evt_sof;
#endif
    }
    else if(_t & USB_OTG_GINTSTS_USBSUSP) /* 仅设备模式访问，USB挂起  */
    {
      evt = usbd_evt_susp;
      USB_OTG_FS_GLOBAL->GINTSTS = USB_OTG_GINTSTS_USBSUSP;
    }
    else if(_t & USB_OTG_GINTSTS_WKUINT) /* 远程唤醒中断 */
    {
      USB_OTG_FS_GLOBAL->GINTSTS = USB_OTG_GINTSTS_WKUINT;
      evt = usbd_evt_wkup;
    }
    else
    {
      /* no more supported events */
      return;
    }
    callback(dev, evt, ep);
  }
#endif
}

static uint32_t fnv1a32_turn (uint32_t fnv, uint32_t data )
{
  for(int i = 0; i < 4 ; i++)
  {
    fnv ^= (data & 0xFF);
    fnv *= 16777619;
    data >>= 8;
  }
  return fnv;
}

static uint16_t get_serialno_desc(void *buffer) {
    struct  usb_string_descriptor *dsc = buffer;
    uint16_t *str = dsc->wString;
    uint32_t fnv = 2166136261;
    fnv = fnv1a32_turn(fnv, *(uint32_t*)(UID_BASE + 0x00));
    fnv = fnv1a32_turn(fnv, *(uint32_t*)(UID_BASE + 0x04));
    fnv = fnv1a32_turn(fnv, *(uint32_t*)(UID_BASE + 0x08));
    for (int i = 28; i >= 0; i -= 4 ) {
        uint16_t c = (fnv >> i) & 0x0F;
        c += (c < 10) ? '0' : ('A' - 10);
        *str++ = c;
    }
    dsc->bDescriptorType = USB_DTYPE_STRING;
    dsc->bLength = 18;
    return 18;
}

/**
 * __attribute__关键字 : 编译器指令，告诉编译器声明的特性，或者让编译器进行更多的错误检查和高级优化。
 * __attribute__((externally_visible)) : 被标记的函数或变量在当前编译单元外部仍然可见。
 */
__attribute__((externally_visible)) const struct usbd_driver usbd_otgfs = {
  getinfo,
  enable,
  connect,
  setaddr,
  ep_config,
  ep_deconfig,
  ep_read,
  ep_write,
  ep_setstall,
  ep_isstalled,
  dcd_int_handler,
  get_frame,
  get_serialno_desc,
};

#endif
